Retrieve the Profile of ExtrusionRoof.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public ModelCurveArray GetProfile()
  Visual Basic
Public Function GetProfile As ModelCurveArray
  Visual C++
public:
ModelCurveArray^ GetProfile()
 See Also
  ExtrusionRoof Class
  Autodesk.Revit.DB Namespace